The panel no longer matches the properties for the Circuit. Disconnect the panel from the Circuit?
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId PanelDoesntMatchCircuitProperties { get; }
  Visual Basic
Public Shared ReadOnly Property PanelDoesntMatchCircuitProperties As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ PanelDoesntMatchCircuitProperties {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MechanicalFailures Class
  Autodesk.Revit.DB Namespace